The  EditorInteraction  type exposes the following members.
 Properties
Name  |   Description
InteractionType
 The type of interaction.
 See Also
  EditorInteraction Class
  Autodesk.Revit.UI Namespace